tap "blacktop/tap"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "sourcegraph/app"
tap "sourcegraph/src-cli"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage compile and link flags for libraries
brew "pkg-config"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Command-line tool for DigitalOcean
brew "doctl"
# Modern replacement for 'ls'
brew "exa"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Generate C code to parse command-line arguments via getopt_long
brew "gengetopt"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Asynchronous event library
brew "libevent"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Colorize logfiles and command output
brew "grc"
# Automatically generate simple man pages
brew "help2man"
# Command-line hex viewer
brew "hexyl"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mini DNS server designed solely to route queries to localhost
brew "launchdns"
# Lets you manipulate the signature block in a Mach-O binary
brew "ldid"
# Pager program similar to more
brew "less"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Generic library support script
brew "libtool"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Port scanning utility for large networks
brew "nmap"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Polyglot runtime manager (asdf rust clone)
brew "rtx"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Generate scripting interfaces to C/C++ code
brew "swig"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# iOS/macOS Research Swiss Army Knife
brew "blacktop/tap/ipsw"
# Sourcegraph CLI
brew "sourcegraph/src-cli/src-cli"
# Android SDK component
cask "android-platform-tools"
# Electronics prototyping platform
cask "arduino-ide"
# Browse/extract images from .car files
cask "asset-catalog-tinkerer"
# GUI for automatically saving SHSH blobs
cask "blobsaver"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Reimagine your terminal
cask "fig"
# Web browser
cask "firefox"
# Software reverse engineering (SRE) suite of tools
cask "ghidra"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Email tracker, read receipt and spy pixel blocker plugin for Apple Mail
cask "mailtrackerblocker"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
mas "Actions", id: 1586435171
mas "Anybuffer", id: 1330815414
mas "Apple Configurator", id: 1037126344
mas "Bear", id: 1091189122
mas "Bluetooth Inspector", id: 1509085044
mas "Data Jar", id: 1453273600
mas "Developer", id: 640199958
mas "Draw Things", id: 6444050820
mas "Esse", id: 1438921989
mas "Flame", id: 325206381
mas "Grammarly for Safari", id: 1462114288
mas "Home Assistant", id: 1099568401
mas "LightBlue", id: 557428110
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Remote Desktop", id: 715768417
mas "Microsoft Word", id: 462054704
mas "MQTTAnalyzer", id: 1493015317
mas "nRF Edge Impulse", id: 1557234087
mas "OctoLinker", id: 1549308269
mas "Pi-hole Remote", id: 1515445551
mas "Pixelmator", id: 407963104
mas "Refined GitHub", id: 1519867270
mas "Sourcegraph for Safari", id: 1543262193
mas "Xcode", id: 497799835
vscode "ahmadawais.shades-of-purple"
vscode "arcanis.vscode-zipfs"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "BeardedBear.beardedicons"
vscode "BeardedBear.beardedtheme"
vscode "bierner.github-markdown-preview"
vscode "bierner.lit-html"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-shiki"
vscode "bierner.markdown-yaml-preamble"
vscode "bmealhouse.shifty"
vscode "bmealhouse.shifty-spicy-theme-pack"
vscode "bokuweb.vscode-ripgrep"
vscode "boyswan.glsl-literal"
vscode "chrislajoie.vscode-modelines"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "cssho.vscode-svgviewer"
vscode "DavidAnson.vscode-markdownlint"
vscode "daylerees.rainglow"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "devkir.elixir-syntax-vscode"
vscode "dmitry-korobchenko.prototxt"
vscode "donjayamanne.githistory"
vscode "dotenv.dotenv-vscode"
vscode "DotJoshJohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "emilast.LogFileHighlighter"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "ESPHome.esphome-vscode"
vscode "folke.vscode-monorepo-workspace"
vscode "GeForceLegend.vscode-glsl"
vscode "gerane.Theme-Solarized-dark"
vscode "Gimly81.fortran"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "guyskk.language-cython"
vscode "hediet.vscode-drawio"
vscode "icrawl.discord-vscode"
vscode "idleberg.openvpn"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeff-hykin.better-perl-syntax"
vscode "jep-a.lua-plus"
vscode "johnpapa.winteriscoming"
vscode "jolaleye.horizon-theme-vscode"
vscode "josetr.cmake-language-support-vscode"
vscode "KatjanaKosic.vscode-json5"
vscode "keesschollaart.vscode-home-assistant"
vscode "kennethceyer.io"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "ldez.ignore-files"
vscode "leizongmin.node-module-intellisense"
vscode "liviuschera.noctis"
vscode "lukas-tr.materialdesignicons-intellisense"
vscode "mark-wiemer.vscode-autohotkey-plus-plus"
vscode "mattn.Lisp"
vscode "ML.nc-gcode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mutantdino.resourcemonitor"
vscode "netcorext.uuid-generator"
vscode "nopeslide.vscode-drawio-plugin-mermaid"
vscode "nopeslide.vscode-drawio-plugin-wavedrom"
vscode "oderwat.indent-rainbow"
vscode "philsinatra.nested-comments"
vscode "platformio.platformio-ide"
vscode "rebornix.nova"
vscode "rebornix.prolog"
vscode "redhat.vscode-yaml"
vscode "rioj7.extra-context"
vscode "rpinski.shebang-snippets"
vscode "ryuta46.multi-command"
vscode "sdras.night-owl"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "slevesque.shader"
vscode "sourcegraph.cody-ai"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "thejustinwalsh.textproto-grammer"
vscode "tinkertrain.theme-panda"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tintinweb.solidity-visual-auditor"
vscode "tintinweb.vscode-ethover"
vscode "tintinweb.vscode-inline-bookmarks"
vscode "tintinweb.vscode-solidity-flattener"
vscode "tintinweb.vscode-solidity-language"
vscode "toasty-technologies.octave"
vscode "trongthanh.theme-boxythemekit"
vscode "ts-defold.defold-vscode-build"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vstirbu.vscode-mermaid-preview"
vscode "wesbos.theme-cobalt2"
vscode "wingrunr21.vscode-ruby"
vscode "withfig.fig"
vscode "xshrim.txt-syntax"
vscode "yuce.erlang-otp"
vscode "yzhang.markdown-all-in-one"
vscode "zhouronghui.propertylist"
vscode "znck.grammarly"
vscode "zxh404.vscode-proto3"
