#tap "apparition47/tap"
tap "blacktop/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
brew "autoconf"
brew "automake"
brew "bash-completion@2"
brew "bat"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "deno"
brew "doctl"
#brew "exa"
brew "fastlane"
brew "fzf"
brew "gengetopt"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "gradle"
brew "help2man"
brew "hexyl"
#brew "hub"
brew "jq"
brew "ldid"
brew "less"
brew "libevent"
brew "libimobiledevice"
brew "libtool"
brew "lsd"
brew "nmap"
brew "pkg-config"
#brew "postgresql"
#brew "postgresql@11"
#brew "postgresql@12"
brew "python@3.9"
brew "redis"
brew "starship"
brew "swig"
brew "tmux"
brew "wakeonlan"
brew "wireguard-tools"
brew "yarn"
brew "zsh"
brew "blacktop/tap/ipsw"
cask "asset-catalog-tinkerer"
cask "blobsaver"
cask "db-browser-for-sqlite"
cask "fig"
cask "ghidra"
cask "iterm2"
cask "mailtrackerblocker"
cask "raycast"
cask "temurin"
